readme加入架构图_构建gitignore
